Revit 2027 API
IExternalDBApplication.OnStartup Method
Implement this method to execute some tasks when Autodesk Revit starts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
ExternalDBApplicationResult OnStartup(
	ControlledApplication application
)
Function OnStartup (
	application As ControlledApplication
) As ExternalDBApplicationResult
ExternalDBApplicationResult OnStartup(
	ControlledApplication^ application
)
abstract OnStartup :
        application : ControlledApplication -> ExternalDBApplicationResult
Parameters
application ControlledApplication
 Handle to the Revit Application object.
Return Value
ExternalDBApplicationResult
Indicates if the external db application completes its work successfully.
Remarks
Typically, event handlers and updaters are registered in this method.
See Also
Reference
IExternalDBApplication Interface
Autodesk.Revit.DB Namespace